{"config": {"name": "HappyModel", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"filters": 32, "activation": "linear", "use_bias": true, "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv0", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [7, 7], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last"}, "name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"config": {"scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "bn0", "axis": 3, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001}, "name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pool", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["max_pool", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fc", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true}, "name": "fc", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["fc", 0, 0]]}, "keras_version": "2.1.3", "class_name": "Model", "backend": "tensorflow"}